app/views/gossips/index.html.erb

        <div class="card-action">
          <a href="#"><%= gossip.user.first_name %>, <%= gossip.user.last_name %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]