app/views/citys/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
---
<%=     f.content  %> <br>
<%=     f.user.first_name  %> <br>