app/controllers/citys_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1)  [["city_id", 71]]
---
      def show
        @id_users = User.find(params['id'])
        @city = @id_users.city_id
        @user = User.where(city_id: @city)
        @gossip = Gossip.where(user_id: @user)