app/controllers/comments_controller.rb

  def edit
    @id_gossips = Gossip.find(params['id'])
    @comment_set = Comment.where(gossip_id: @id_gossips)
    @comments = Comment.where(id: @comment_set )
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."gossip_id" = $1)  [["gossip_id", 93]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]