app/controllers/gossips_controller.rb

    def index

        @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

      def show
        @id_gossips = Gossip.find(params['id'])
        @comments = Comment.all
        @comment_set = Comment.where(gossip_id: @id_gossips)
        @comment_author = User.where(id: @id_gossips.user_id)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 93]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

      def edit
        @id_gossips = Gossip.find(params['id'])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def update
        @id_gossips = Gossip.find(params['id'])
        gossip_params = params.require(:gossip).permit(:title, :content)
        @id_gossips.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "His tejars can cure cancer, too bad he never cries"], ["updated_at", "2019-02-06 13:39:04.790776"], ["id", 12]]

      def destroy
        @gossip = Gossip.find(params['id'])
        @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]

      def create

        @gossip = Gossip.create(gossip_params)
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dzadz"], ["content", "szasza"], ["user_id", 5], ["created_at", "2019-02-06 13:13:24.119235"], ["updated_at", "2019-02-06 13:13:24.119235"]]